Revit 2026 API

# WorksharingDisplaySettingsGetOrCreateWorksharingDisplaySettings Method

---

Returns the worksharing display settings for the document, creating new settings for the current user if necessary.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static WorksharingDisplaySettings GetOrCreateWorksharingDisplaySettings(
	Document doc
)
```
```vb
Public Shared Function GetOrCreateWorksharingDisplaySettings (
	doc As Document
) As WorksharingDisplaySettings
```
```cpp
public:
static WorksharingDisplaySettings^ GetOrCreateWorksharingDisplaySettings(
	Document^ doc
)
```
```fsharp
static member GetOrCreateWorksharingDisplaySettings :
        doc : Document -> WorksharingDisplaySettings
```

#### Parameters

doc Document
     The document of interest.

#### Return Value

WorksharingDisplaySettings The worksharing display settings for the document.

| Exception | Condition |
| --- | --- |
| ArgumentException | doc is not a project document. |
| ArgumentNullException | A non-optional argument was null |

Note that these settings are available even in models that are not workshared. This is to allow pre-configuring the display settings before enabling worksets so that they can be stored in template files.

#### Reference

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace